app/Controllers/Anfitrion/Anfitrion.php

    public function index()
    {
        /*Muestra la vista de inicio del anfitrion*/
        return view('anfitrion/inicio', [
        'servicios' => $this->modelServicio->where('idAnfitrion', session('idAnfitrion'))->findAll(),
        'paises' => $this->modelPais->findAll(),
        'departamento' => $this->modelDepartamento->findAll(),
        'municipios' => $this->modelMunicipio->findAll(),
        'tarifas' => $this->modelTarifas->findAll(),
        'tipoHospedajes' => $this->model->findAll(),
---
SELECT *
FROM `tbl_paises`
SELECT *
FROM `tbl_departamentos`
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`

    public function publicar()
    {
           /*Muestra la vista de publicar del anfitrión y se pasa los parametros de todos los tipo de hospedajes*/
           return view ('anfitrion/publicar',[
               'tipoHospedajes' => $this->model->findAll(),
               'paises' => $this->modelPais->findAll(),
               'departamentos' => $this->modelDepartamento->findAll(),
               'municipios' => $this->modelMunicipio->findAll(),

           ]);
---
SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_paises`
SELECT *
FROM `tbl_departamentos`
SELECT *
FROM `tbl_municipios`

            'descuento' => $this->request->getPost('descuento'),
        ];
        /*Se guarda la tarifa en la tabla tarifa que el Anfitrion asignó para su servicio */
        $this->modelTarifas->save($recuperarPostPublicaciones);
---
INSERT INTO `tbl_tarifas` (`precio`, `descuento`, `date_create`, `date_update`) VALUES ('45', '0', '2022-08-03 14:03:02', '2022-08-03 14:03:02')

        $this->modelServicio->agregarFoto($direccionGuardado);

            /*Guarda los datos del usuario*/
        $this->modelServicio->save($recuperarPostUsuario);
---
INSERT INTO `tbl_servicios` (`nombre`, `descripcion`, `idTipoHospedaje`, `direccion`, `idTarifa`, `idMunicipio`, `disponibilidad`, `foto`, `idAnfitrion`, `date_create`, `date_update`) VALUES ('ds', 'dad', '1', 'sfdsf', 3, '18', 1, '/img/publicaciones/5/', '5', '2022-08-03 14:03:02', '2022-08-03 14:03:02')