app/Controllers/Anfitrion/Vistas.php

SELECT `idServicio`
FROM `tbl_servicios`
WHERE `idAnfitrion` = '5'
SELECT *
FROM `tbl_imagenes`
WHERE `idServicio` IN ('3','12')
SELECT *
FROM `tbl_servicios`
WHERE `idAnfitrion` = '5'
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_tarifas`
SELECT *
FROM `tbl_tipo_hospedajes`
---
    public function index(){
        $arrayServicios = $this->modelServicio->where('idAnfitrion', session('idAnfitrion'))->findColumn('idServicio');
        if($arrayServicios != null){
            $imagenes = $this->modelImagenes->whereIn('idServicio',$arrayServicios)->findAll();
        }else{
            $imagenes[] = 0;
        }
        /*Muestra la vista de inicio del anfitrion*/
        //dd($this->modelImagenes->whereIn('idServicio',$arrayServicios)->findAll());
        return view('anfitrion/inicio', [
        'servicios' => $this->modelServicio->where('idAnfitrion', session('idAnfitrion'))->findAll(),
        'municipios' => $this->modelMunicipio->findAll(),
        'tarifas' => $this->modelTarifas->findAll(),
        'tipoHospedajes' => $this->modelTipoHospedaje->findAll(),
        'imagenes' => $imagenes
        ]);

SELECT *
FROM `tbl_servicios`
SELECT `idAnfitrion`
FROM `tbl_servicios`
WHERE `idServicio` = '5'
SELECT `idTarifa`
FROM `tbl_servicios`
WHERE `idServicio` = '5'
SELECT `idTipoHospedaje`
FROM `tbl_servicios`
WHERE `idServicio` = '5'
SELECT `idSubServicio`
FROM `tbl_guardar_sub_servicios`
WHERE `idServicio` = '5'
SELECT `idMunicipio`
FROM `tbl_servicios`
WHERE `idServicio` = '5'
SELECT `idDepartamento`
FROM `tbl_municipios`
WHERE `idMunicipio` = ('253')
SELECT `idPais`
FROM `tbl_departamentos`
WHERE `idDepartamento` = ('14')
---
    public function verServicio(){
        if(!isset($_GET['id'])){
            return redirect()->route('anfitrionInicio');
        }

        $valorIdServicio = $_GET['id'];
        $idServicio = null;
        $buscar = $this->modelServicio->findAll();

        foreach ($buscar as $key) {
            if(password_verify($key->idServicio,$valorIdServicio)){
                $idServicio = $key->idServicio;
                break;
            }
        }
        if($idServicio == null){
            return redirect()->back()->withInput()->with('msg',[
                'type'=>'danger',
                'body'=>'Error!'
            ]);
        }
        $buscarAnfitrion = $this->modelServicio->where('idServicio',$idServicio)->findColumn('idAnfitrion');
        $buscarTarifa = $this->modelServicio->where('idServicio',$idServicio)->findColumn('idTarifa');
        $buscarUsuario = $this->modelAnfitrion->where('idAnfitrion',$buscarAnfitrion)->findColumn('idUsuario');
        $buscarTipoHospedaje = $this->modelServicio->where('idServicio',$idServicio)->findColumn('idTipoHospedaje');
        $buscarIdiomaPrimario = $this->modelAnfitrion->where('idAnfitrion',$buscarAnfitrion)->findColumn('idiomaPrimario');
        $buscarIdiomaSecundario = $this->modelAnfitrion->where('idAnfitrion',$buscarAnfitrion)->findColumn('idiomaSecundario');
        $buscarIdiomaExtra = $this->modelAnfitrion->where('idAnfitrion',$buscarAnfitrion)->findColumn('idiomaExtra');
        $arraySubServicios = $this->modelGuardarSubServicios->where('idServicio',$idServicio)->findColumn('idSubServicio');
        $arrayPoliticaCancelacion = $this->modelGuardarPoliticaCancelacion->where('idServicio',$idServicio)->findColumn('idPoliticaCancelacion');
        $arrayReglaServicio = $this->modelGuardarReglaServicios->where('idServicio',$idServicio)->findColumn('idReglaServicio');
        $arraySaludSeguridad = $this->modelGuardarSaludSeguridad->where('idServicio',$idServicio)->findColumn('idSaludSeguridad');
        $buscarMunicipio = $this->modelServicio->where('idServicio',$idServicio)->findColumn('idMunicipio');
        $buscarDepartamento = $this->modelMunicipio->where('idMunicipio',$buscarMunicipio)->findColumn('idDepartamento');
        $buscarPais = $this->modelDepartamento->where('idDepartamento',$buscarDepartamento)->findColumn('idPais');

SELECT *
FROM `tbl_usuarios`
WHERE `idUsuario` = ('1')
SELECT *
FROM `tbl_sub_servicios`
WHERE `idSubServicio` IN ('1','2')
SELECT *
FROM `tbl_servicios`
WHERE `idServicio` = '5'
SELECT *
FROM `tbl_huespedes`
WHERE `idServicio` = '5'
SELECT *
FROM `tbl_imagenes`
WHERE `idServicio` = '5'
SELECT *
FROM `tbl_tarifas`
WHERE `idTarifa` = ('5')
SELECT *
FROM `tbl_idiomas`
WHERE `idIdioma` = ('26')
SELECT *
FROM `tbl_idiomas`
WHERE `idIdioma` = ('47')
SELECT *
FROM `tbl_idiomas`
WHERE `idIdioma` = ('31')
SELECT *
FROM `tbl_tipo_hospedajes`
WHERE `idTipoHospedaje` = ('2')
SELECT *
FROM `tbl_departamentos`
WHERE `idDepartamento` = ('14')
SELECT *
FROM `tbl_municipios`
WHERE `idMunicipio` = ('253')
---

        return view('anfitrion/servicio', [
            'servicio' => $this->modelServicio->where('idServicio',$idServicio)->findAll(),
            'usuario' => $this->modelUsuario->where('idUsuario',$buscarUsuario)->findAll(),
            'politicaCancelacion' => $this->modelPoliticaCancelacion->whereIn('idPoliticaCancelacion',$arrayPoliticaCancelacion)->findAll(),
            'reglaServicio' => $this->modelReglaServicios->whereIn('idReglaServicio',$arrayReglaServicio)->findAll(),
            'saludSeguridad' => $this->modelSaludSeguridad->whereIn('idSaludSeguridad',$arraySaludSeguridad)->findAll(),
            'subServicio' => $this->modelSubServicios->whereIn('idSubServicio',$arraySubServicios)->findAll(),
            'huespedes'=> $this->modelHuespedes->where('idServicio',$idServicio)->findAll(),
            'imagenes' => $this->modelImagenes->where('idServicio',$idServicio)->findAll(),
            'tarifa' => $this->modelTarifas->where('idTarifa',$buscarTarifa)->findAll(),
            'anfitrion' => $this->modelAnfitrion->where('idAnfitrion',$buscarAnfitrion)->findAll(),
            'idiomaPrimario' => $this->modelIdiomas->where('idIdioma',$buscarIdiomaPrimario)->findAll(),
            'idiomaSecundario' => $this->modelIdiomas->where('idIdioma',$buscarIdiomaSecundario)->findAll(),
            'idiomaExtra' => $this->modelIdiomas->where('idIdioma',$buscarIdiomaExtra)->findAll(),
            'tipoHospedaje' => $this->modelTipoHospedaje->where('idTipoHospedaje',$buscarTipoHospedaje)->findAll(),
            'pais' => $this->modelPais->where('idPais',$buscarPais)->findAll(),
            'departamento' => $this->modelDepartamento->where('idDepartamento',$buscarDepartamento)->findAll(),
            'municipio' => $this->modelMunicipio->where('idMunicipio', $buscarMunicipio)->findAll(),

SELECT *
FROM `tbl_usuarios`
WHERE `tbl_usuarios`.`idUsuario` = '1'
---
    public function perfil(){
        return view('anfitrion/perfil', [
            'usuario' => $this->modelUsuario->find(session('idUsuario')),
            'anfitrion' => $this->modelAnfitrion->find(session('idAnfitrion')),
        ]);

SELECT *
FROM `tbl_tipo_hospedajes`
SELECT *
FROM `tbl_paises`
SELECT *
FROM `tbl_departamentos`
SELECT *
FROM `tbl_municipios`
SELECT *
FROM `tbl_sub_servicios`
---
public function publicar(){
    return view ('anfitrion/publicar',[
        'tipoHospedajes' => $this->modelTipoHospedaje->findAll(),
        'paises' => $this->modelPais->findAll(),
        'departamentos' => $this->modelDepartamento->findAll(),
        'municipios' => $this->modelMunicipio->findAll(),
        'subServicios' => $this->modelSubServicios->findAll(),
        'saludSeguridad' => $this->modelSaludSeguridad->findAll(),
        'reglaServicios' => $this->modelReglaServicios->findAll(),
        'politicaCancelacion' => $this->modelPoliticaCancelacion->findAll()

    ]);