app/Models/AnfitrionesModel.php

    public function agregarElUsuario(string $email){
        $row = $this->db()->table('tbl_usuarios')->where('email',$email)->get()->getFirstRow();
---
SELECT *
FROM `tbl_usuarios`
WHERE `email` = 'sabino@gmail.com'

    public function agregarIdiomaPrimario(string $idioma){
        $row = $this->db()->table('tbl_idiomas')->where('idioma',$idioma)->get()->getFirstRow();
---
SELECT *
FROM `tbl_idiomas`
WHERE `idioma` = 'Canarés'

    public function agregarIdiomaSecundario(string $idioma){
        $row = $this->db()->table('tbl_idiomas')->where('idioma',$idioma)->get()->getFirstRow();
---
SELECT *
FROM `tbl_idiomas`
WHERE `idioma` = 'Checo'

    public function agregarIdiomaExtra(string $idioma){
        $row = $this->db()->table('tbl_idiomas')->where('idioma',$idioma)->get()->getFirstRow();
---
SELECT *
FROM `tbl_idiomas`
WHERE `idioma` = 'Bengalí'