app/Models/UsuarioModel.php

    public function agregarCambiarRol(string $rol){
        $row = $this->db()->table('tbl_roles')->where('rol',$rol)->get()->getFirstRow();
---
SELECT *
FROM `tbl_roles`
WHERE `rol` = 'Anfitrion'

    public function buscarRol(string $value){
        $row = $this->db()->table('tbl_roles')->where('idRol',$value)->get()->getFirstRow();
---
SELECT *
FROM `tbl_roles`
WHERE `idRol` = '2'

    public function buscarRolDos(string $value){
        $row = $this->db()->table('tbl_roles')->where('idRol',$value)->get()->getFirstRow();
---
SELECT *
FROM `tbl_roles`
WHERE `idRol` = '3'