app/Controllers/Usuario/Usuarios.php

SELECT *
FROM `tbl_idiomas`
---
        /*Se carga el modelo IdiomasModel*/
        $model = model('IdiomasModel');
        /*Se muestra la vista de hazte un anfitrion y se pasa los parametros de todos los idiomas*/
        return view('usuario/hazteAnfitrion',[
            'idiomas' => $model->findAll()
        ]);

UPDATE `tbl_usuarios` SET `idRol` = '3', `idRol2` = '3', `date_update` = '2022-06-23 13:47:30'
WHERE `tbl_usuarios`.`idUsuario` IN ('10')
---
            'idRol2' => $modelUsuario->asignarCambiarRol
        ];
        /*Se guardan los datos actualizados del usuario*/
        $modelUsuario->save($data);